Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSbcu_regdef.h
/**
 * \file IfxSbcu_regdef.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 *
 * Date: 2015-12-17 16:15:59 GMT
 * Version: TBD
 * Specification: TBD
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Sbcu_Registers SbcuRegisters
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Sbcu_Registers_Bitfields Bitfields
 * \ingroup IfxLld_Sbcu_Registers
 * 
 * \defgroup IfxLld_Sbcu_Registers_union Register unions
 * \ingroup IfxLld_Sbcu_Registers
 * 
 * \defgroup IfxLld_Sbcu_Registers_struct Memory map
 * \ingroup IfxLld_Sbcu_Registers
 */
#ifndef IFXSBCU_REGDEF_H
#define IFXSBCU_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Sbcu_Bitfields
 * \{  */
/** \brief Access Enable Register 0 */
typedef struct _Ifx_SBCU_ACCEN0_Bits
{
    Ifx_UReg_32Bit EN0:1;             /**< \brief [0:0] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN1:1;             /**< \brief [1:1] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN2:1;             /**< \brief [2:2] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN3:1;             /**< \brief [3:3] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN4:1;             /**< \brief [4:4] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN5:1;             /**< \brief [5:5] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN6:1;             /**< \brief [6:6] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN7:1;             /**< \brief [7:7] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN8:1;             /**< \brief [8:8] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN9:1;             /**< \brief [9:9] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN10:1;            /**< \brief [10:10] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN11:1;            /**< \brief [11:11] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN12:1;            /**< \brief [12:12] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN13:1;            /**< \brief [13:13] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN14:1;            /**< \brief [14:14] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN15:1;            /**< \brief [15:15] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN16:1;            /**< \brief [16:16] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN17:1;            /**< \brief [17:17] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN18:1;            /**< \brief [18:18] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN19:1;            /**< \brief [19:19] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN20:1;            /**< \brief [20:20] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN21:1;            /**< \brief [21:21] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN22:1;            /**< \brief [22:22] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN23:1;            /**< \brief [23:23] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN24:1;            /**< \brief [24:24] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN25:1;            /**< \brief [25:25] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN26:1;            /**< \brief [26:26] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN27:1;            /**< \brief [27:27] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN28:1;            /**< \brief [28:28] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN29:1;            /**< \brief [29:29] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN30:1;            /**< \brief [30:30] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN31:1;            /**< \brief [31:31] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
} Ifx_SBCU_ACCEN0_Bits;

/** \brief Access Enable Register 1 */
typedef struct _Ifx_SBCU_ACCEN1_Bits
{
    Ifx_UReg_32Bit reserved_0:32;     /**< \brief [31:0] \internal Reserved */
} Ifx_SBCU_ACCEN1_Bits;

/** \brief SBCU EDC Alarm Clear Register ${x} */
typedef struct _Ifx_SBCU_ALCLR_Bits
{
    Ifx_UReg_32Bit CLR0:1;            /**< \brief [0:0] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR1:1;            /**< \brief [1:1] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR2:1;            /**< \brief [2:2] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR3:1;            /**< \brief [3:3] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR4:1;            /**< \brief [4:4] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR5:1;            /**< \brief [5:5] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR6:1;            /**< \brief [6:6] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR7:1;            /**< \brief [7:7] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR8:1;            /**< \brief [8:8] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR9:1;            /**< \brief [9:9] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR10:1;           /**< \brief [10:10] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR11:1;           /**< \brief [11:11] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR12:1;           /**< \brief [12:12] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR13:1;           /**< \brief [13:13] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR14:1;           /**< \brief [14:14] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR15:1;           /**< \brief [15:15] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR16:1;           /**< \brief [16:16] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR17:1;           /**< \brief [17:17] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR18:1;           /**< \brief [18:18] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR19:1;           /**< \brief [19:19] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR20:1;           /**< \brief [20:20] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR21:1;           /**< \brief [21:21] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR22:1;           /**< \brief [22:22] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR23:1;           /**< \brief [23:23] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR24:1;           /**< \brief [24:24] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR25:1;           /**< \brief [25:25] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR26:1;           /**< \brief [26:26] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR27:1;           /**< \brief [27:27] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR28:1;           /**< \brief [28:28] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR29:1;           /**< \brief [29:29] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR30:1;           /**< \brief [30:30] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR31:1;           /**< \brief [31:31] Alarm ${y} - CLR${y} (w) */
} Ifx_SBCU_ALCLR_Bits;

/** \brief SBCU EDC Alarm Control Register */
typedef struct _Ifx_SBCU_ALCTRL_Bits
{
    Ifx_UReg_32Bit ALOV:1;            /**< \brief [0:0] Alarm Overflow - ALOV (rh) */
    Ifx_UReg_32Bit ALOVCLR:1;         /**< \brief [1:1] Alarm Overflow Clear - ALOVCLR (w) */
    Ifx_UReg_32Bit reserved_2:30;     /**< \brief [31:2] \internal Reserved */
} Ifx_SBCU_ALCTRL_Bits;

/** \brief SBCU EDC Alarm Status Register 0 */
typedef struct _Ifx_SBCU_ALSTAT0_Bits
{
    Ifx_UReg_32Bit SBCU_S:1;          /**< \brief [0:0] Alarm SBCU Slave Interface - SBCU_S (rh) */
    Ifx_UReg_32Bit CERBERUS_S:1;      /**< \brief [1:1] Alarm CERBERUS Slave Interface - CERBERUS_S (rh) */
    Ifx_UReg_32Bit IR_S:1;            /**< \brief [2:2] Alarm Interrupt Router (IR) Slave Interface - IR_S (rh) */
    Ifx_UReg_32Bit SFI_F2S_S:1;       /**< \brief [3:3] Alarm FPI to SRI Bridge Slave Interface - SFI_F2S_S (rh) */
    Ifx_UReg_32Bit SCU_S:1;           /**< \brief [4:4] Alarm SCU Slave Interface - SCU_S (rh) */
    Ifx_UReg_32Bit SMU_S:1;           /**< \brief [5:5] Alarm SMU Slave Interface - SMU_S (rh) */
    Ifx_UReg_32Bit PMC_S:1;           /**< \brief [6:6] Alarm PMC Slave Interface Slave Interface - PMC_S (rh) */
    Ifx_UReg_32Bit MTU_S:1;           /**< \brief [7:7] Alarm MTU - MTU_S (rh) */
    Ifx_UReg_32Bit reserved_8:1;      /**< \brief [8:8] \internal Reserved */
    Ifx_UReg_32Bit reserved_9:1;      /**< \brief [9:9] \internal Reserved */
    Ifx_UReg_32Bit reserved_10:1;     /**< \brief [10:10] \internal Reserved */
    Ifx_UReg_32Bit reserved_11:1;     /**< \brief [11:11] \internal Reserved */
    Ifx_UReg_32Bit reserved_12:1;     /**< \brief [12:12] \internal Reserved */
    Ifx_UReg_32Bit reserved_13:1;     /**< \brief [13:13] \internal Reserved */
    Ifx_UReg_32Bit reserved_14:1;     /**< \brief [14:14] \internal Reserved */
    Ifx_UReg_32Bit reserved_15:1;     /**< \brief [15:15] \internal Reserved */
    Ifx_UReg_32Bit reserved_16:1;     /**< \brief [16:16] \internal Reserved */
    Ifx_UReg_32Bit reserved_17:1;     /**< \brief [17:17] \internal Reserved */
    Ifx_UReg_32Bit reserved_18:1;     /**< \brief [18:18] \internal Reserved */
    Ifx_UReg_32Bit reserved_19:1;     /**< \brief [19:19] \internal Reserved */
    Ifx_UReg_32Bit reserved_20:1;     /**< \brief [20:20] \internal Reserved */
    Ifx_UReg_32Bit reserved_21:1;     /**< \brief [21:21] \internal Reserved */
    Ifx_UReg_32Bit reserved_22:1;     /**< \brief [22:22] \internal Reserved */
    Ifx_UReg_32Bit reserved_23:1;     /**< \brief [23:23] \internal Reserved */
    Ifx_UReg_32Bit reserved_24:1;     /**< \brief [24:24] \internal Reserved */
    Ifx_UReg_32Bit reserved_25:1;     /**< \brief [25:25] \internal Reserved */
    Ifx_UReg_32Bit reserved_26:1;     /**< \brief [26:26] \internal Reserved */
    Ifx_UReg_32Bit reserved_27:1;     /**< \brief [27:27] \internal Reserved */
    Ifx_UReg_32Bit reserved_28:1;     /**< \brief [28:28] \internal Reserved */
    Ifx_UReg_32Bit reserved_29:1;     /**< \brief [29:29] \internal Reserved */
    Ifx_UReg_32Bit reserved_30:1;     /**< \brief [30:30] \internal Reserved */
    Ifx_UReg_32Bit reserved_31:1;     /**< \brief [31:31] \internal Reserved */
} Ifx_SBCU_ALSTAT0_Bits;

/** \brief SBCU EDC Alarm Status Register 1 */
typedef struct _Ifx_SBCU_ALSTAT1_Bits
{
    Ifx_UReg_32Bit reserved_0:1;      /**< \brief [0:0] \internal Reserved */
    Ifx_UReg_32Bit reserved_1:1;      /**< \brief [1:1] \internal Reserved */
    Ifx_UReg_32Bit reserved_2:1;      /**< \brief [2:2] \internal Reserved */
    Ifx_UReg_32Bit reserved_3:1;      /**< \brief [3:3] \internal Reserved */
    Ifx_UReg_32Bit reserved_4:1;      /**< \brief [4:4] \internal Reserved */
    Ifx_UReg_32Bit reserved_5:1;      /**< \brief [5:5] \internal Reserved */
    Ifx_UReg_32Bit reserved_6:1;      /**< \brief [6:6] \internal Reserved */
    Ifx_UReg_32Bit reserved_7:1;      /**< \brief [7:7] \internal Reserved */
    Ifx_UReg_32Bit reserved_8:1;      /**< \brief [8:8] \internal Reserved */
    Ifx_UReg_32Bit EVADC_S:1;         /**< \brief [9:9] Alarm EVADC - EVADC_S (rh) */
    Ifx_UReg_32Bit reserved_10:1;     /**< \brief [10:10] \internal Reserved */
    Ifx_UReg_32Bit reserved_11:1;     /**< \brief [11:11] \internal Reserved */
    Ifx_UReg_32Bit reserved_12:1;     /**< \brief [12:12] \internal Reserved */
    Ifx_UReg_32Bit reserved_13:1;     /**< \brief [13:13] \internal Reserved */
    Ifx_UReg_32Bit reserved_14:1;     /**< \brief [14:14] \internal Reserved */
    Ifx_UReg_32Bit reserved_15:1;     /**< \brief [15:15] \internal Reserved */
    Ifx_UReg_32Bit reserved_16:1;     /**< \brief [16:16] \internal Reserved */
    Ifx_UReg_32Bit reserved_17:1;     /**< \brief [17:17] \internal Reserved */
    Ifx_UReg_32Bit reserved_18:1;     /**< \brief [18:18] \internal Reserved */
    Ifx_UReg_32Bit reserved_19:1;     /**< \brief [19:19] \internal Reserved */
    Ifx_UReg_32Bit reserved_20:1;     /**< \brief [20:20] \internal Reserved */
    Ifx_UReg_32Bit reserved_21:1;     /**< \brief [21:21] \internal Reserved */
    Ifx_UReg_32Bit reserved_22:1;     /**< \brief [22:22] \internal Reserved */
    Ifx_UReg_32Bit reserved_23:1;     /**< \brief [23:23] \internal Reserved */
    Ifx_UReg_32Bit reserved_24:1;     /**< \brief [24:24] \internal Reserved */
    Ifx_UReg_32Bit reserved_25:1;     /**< \brief [25:25] \internal Reserved */
    Ifx_UReg_32Bit reserved_26:1;     /**< \brief [26:26] \internal Reserved */
    Ifx_UReg_32Bit reserved_27:1;     /**< \brief [27:27] \internal Reserved */
    Ifx_UReg_32Bit reserved_28:1;     /**< \brief [28:28] \internal Reserved */
    Ifx_UReg_32Bit reserved_29:1;     /**< \brief [29:29] \internal Reserved */
    Ifx_UReg_32Bit reserved_30:1;     /**< \brief [30:30] \internal Reserved */
    Ifx_UReg_32Bit reserved_31:1;     /**< \brief [31:31] \internal Reserved */
} Ifx_SBCU_ALSTAT1_Bits;

