Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSbcu_regdef.h
/** \brief SBCU Debug Data Status Register */
typedef struct _Ifx_SBCU_DBDAT_Bits
{
    Ifx_UReg_32Bit FPIDATA:32;        /**< \brief [31:0] FPI Bus Data Status - FPIDATA (rh) */
} Ifx_SBCU_DBDAT_Bits;

/** \brief SBCU Debug Trapped Master Register */
typedef struct _Ifx_SBCU_DBGNTT_Bits
{
    Ifx_UReg_32Bit SFI_S2F:1;         /**< \brief [0:0] SRI to FPI Bridge FPI Bus Master Status (DMA / Cerberus) - SFI_S2F (rwh) */
    Ifx_UReg_32Bit reserved_1:1;      /**< \brief [1:1] \internal Reserved */
    Ifx_UReg_32Bit SDMMC:1;           /**< \brief [2:2] SDMMC FPI Bus Master Status - SDMMC (rwh) */
    Ifx_UReg_32Bit HSSL0:1;           /**< \brief [3:3] HSSL 0 FPI Bus Master Status - HSSL0 (rwh) */
    Ifx_UReg_32Bit HSSL1:1;           /**< \brief [4:4] HSSL 1 FPI Bus Master Status - HSSL1 (rwh) */
    Ifx_UReg_32Bit reserved_5:1;      /**< \brief [5:5] \internal Reserved */
    Ifx_UReg_32Bit CPU0:1;            /**< \brief [6:6] CPU0 FPI Bus Master Status - CPU0 (rwh) */
    Ifx_UReg_32Bit CPU1:1;            /**< \brief [7:7] CPU1 FPI Bus Master Status - CPU1 (rwh) */
    Ifx_UReg_32Bit CPU2:1;            /**< \brief [8:8] CPU2 FPI Bus Master Status - CPU2 (rwh) */
    Ifx_UReg_32Bit CPU3:1;            /**< \brief [9:9] CPU3 FPI Bus Master Status - CPU3 (rwh) */
    Ifx_UReg_32Bit CPU4:1;            /**< \brief [10:10] CPU1 FPI Bus Master Status - CPU4 (rwh) */
    Ifx_UReg_32Bit CPU5:1;            /**< \brief [11:11] CPU5 FPI Bus Master Status - CPU5 (rwh) */
    Ifx_UReg_32Bit HSMRMI:1;          /**< \brief [12:12] HSM Register FPI Bus Master Interface Status - HSMRMI (rwh) */
    Ifx_UReg_32Bit HSMCMI:1;          /**< \brief [13:13] HSM Cache FPI Bus Master Interface Status - HSMCMI (rwh) */
    Ifx_UReg_32Bit reserved_14:1;     /**< \brief [14:14] \internal Reserved */
    Ifx_UReg_32Bit reserved_15:1;     /**< \brief [15:15] \internal Reserved */
    Ifx_UReg_32Bit reserved_16:1;     /**< \brief [16:16] \internal Reserved */
    Ifx_UReg_32Bit reserved_17:1;     /**< \brief [17:17] \internal Reserved */
    Ifx_UReg_32Bit reserved_18:1;     /**< \brief [18:18] \internal Reserved */
    Ifx_UReg_32Bit reserved_19:1;     /**< \brief [19:19] \internal Reserved */
    Ifx_UReg_32Bit reserved_20:1;     /**< \brief [20:20] \internal Reserved */
    Ifx_UReg_32Bit reserved_21:1;     /**< \brief [21:21] \internal Reserved */
    Ifx_UReg_32Bit reserved_22:1;     /**< \brief [22:22] \internal Reserved */
    Ifx_UReg_32Bit reserved_23:1;     /**< \brief [23:23] \internal Reserved */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_SBCU_DBGNTT_Bits;

/** \brief SBCU Debug Grant Mask Register */
typedef struct _Ifx_SBCU_DBGRNT_Bits
{
    Ifx_UReg_32Bit SFI_S2F:1;         /**< \brief [0:0] SRI to FPI Bridge Trigger Enable(Cerberus / DMA) - SFI_S2F (rw) */
    Ifx_UReg_32Bit reserved_1:1;      /**< \brief [1:1] \internal Reserved */
    Ifx_UReg_32Bit SDMMC:1;           /**< \brief [2:2] SDMMC Trigger Enable - SDMMC (rw) */
    Ifx_UReg_32Bit HSSL0:1;           /**< \brief [3:3] HSSL0 Trigger Enable - HSSL0 (rw) */
    Ifx_UReg_32Bit HSSL1:1;           /**< \brief [4:4] HSSL1 Trigger Enable - HSSL1 (rw) */
    Ifx_UReg_32Bit reserved_5:1;      /**< \brief [5:5] \internal Reserved */
    Ifx_UReg_32Bit CPU0:1;            /**< \brief [6:6] CPU0 Grant Trigger Enable - CPU0 (rw) */
    Ifx_UReg_32Bit CPU1:1;            /**< \brief [7:7] CPU1 Grant Trigger Enable - CPU1 (rw) */
    Ifx_UReg_32Bit CPU2:1;            /**< \brief [8:8] CPU2 Grant Trigger Enable - CPU2 (rw) */
    Ifx_UReg_32Bit CPU3:1;            /**< \brief [9:9] CPU3 Grant Trigger Enable - CPU3 (rw) */
    Ifx_UReg_32Bit CPU4:1;            /**< \brief [10:10] CPU4 Grant Trigger Enable - CPU4 (rw) */
    Ifx_UReg_32Bit CPU5:1;            /**< \brief [11:11] CPU5 Grant Trigger Enable - CPU5 (rw) */
    Ifx_UReg_32Bit HSMRMI:1;          /**< \brief [12:12] HSM Register Master Interface Grant Trigger Enable - HSMRMI (rw) */
    Ifx_UReg_32Bit HSMCMI:1;          /**< \brief [13:13] HSM Cache Master Interface Grant Trigger Enable - HSMCMI (rw) */
    Ifx_UReg_32Bit reserved_14:1;     /**< \brief [14:14] \internal Reserved */
    Ifx_UReg_32Bit reserved_15:1;     /**< \brief [15:15] \internal Reserved */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_SBCU_DBGRNT_Bits;

/** \brief SBCU Error Address Capture Register */
typedef struct _Ifx_SBCU_EADD_Bits
{
    Ifx_UReg_32Bit FPIADR:32;         /**< \brief [31:0] Captured FPI Bus Address - FPIADR (rwh) */
} Ifx_SBCU_EADD_Bits;

/** \brief SBCU Error Control Capture Register */
typedef struct _Ifx_SBCU_ECON_Bits
{
    Ifx_UReg_32Bit ERRCNT:14;         /**< \brief [13:0] FPI Bus Error Counter - ERRCNT (rwh) */
    Ifx_UReg_32Bit TOUT:1;            /**< \brief [14:14] State of FPI Bus Time-Out Signal - TOUT (rwh) */
    Ifx_UReg_32Bit RDY:1;             /**< \brief [15:15] State of FPI Bus Ready Signal - RDY (rwh) */
    Ifx_UReg_32Bit ABT:1;             /**< \brief [16:16] State of FPI Bus Abort Signal - ABT (rwh) */
    Ifx_UReg_32Bit ACK:2;             /**< \brief [18:17] State of FPI Bus Acknowledge Signals - ACK (rwh) */
    Ifx_UReg_32Bit SVM:1;             /**< \brief [19:19] State of FPI Bus Supervisor Mode Signal - SVM (rwh) */
    Ifx_UReg_32Bit WRN:1;             /**< \brief [20:20] State of FPI Bus Write Signal - WRN (rwh) */
    Ifx_UReg_32Bit RDN:1;             /**< \brief [21:21] State of FPI Bus Read Signal - RDN (rwh) */
    Ifx_UReg_32Bit TAG:6;             /**< \brief [27:22] FPI Bus Master Tag Number Signals - TAG (rwh) */
    Ifx_UReg_32Bit OPC:4;             /**< \brief [31:28] FPI Bus Operation Code Signals - OPC (rwh) */
} Ifx_SBCU_ECON_Bits;

/** \brief SBCU Error Data Capture Register */
typedef struct _Ifx_SBCU_EDAT_Bits
{
    Ifx_UReg_32Bit FPIDAT:32;         /**< \brief [31:0] Captured FPI Bus Data - FPIDAT (rwh) */
} Ifx_SBCU_EDAT_Bits;

/** \brief FPI Error Generation Control Register */
typedef struct _Ifx_SBCU_FEGEN_Bits
{
    Ifx_UReg_32Bit SEDM:3;            /**< \brief [2:0] SEDM (Slave Encoder) - SEDM (rw) */
    Ifx_UReg_32Bit reserved_3:5;      /**< \brief [7:3] \internal Reserved */
    Ifx_UReg_32Bit MEDM:3;            /**< \brief [10:8] MEDM (Master Encoder) Type of Error - MEDM (rw) */
    Ifx_UReg_32Bit reserved_11:5;     /**< \brief [15:11] \internal Reserved */
    Ifx_UReg_32Bit EN:3;              /**< \brief [18:16] Enable Signal Type of Error - EN (rw) */
    Ifx_UReg_32Bit reserved_19:5;     /**< \brief [23:19] \internal Reserved */
    Ifx_UReg_32Bit BCU:2;             /**< \brief [25:24] BCU Type of Error - BCU (rw) */
    Ifx_UReg_32Bit reserved_26:6;     /**< \brief [31:26] \internal Reserved */
} Ifx_SBCU_FEGEN_Bits;

