Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSbcu_regdef.h
/** \brief Module Identification Register */
typedef struct _Ifx_SBCU_ID_Bits
{
    Ifx_UReg_32Bit MOD_REV:8;         /**< \brief [7:0] Module Revision Number - MOD_REV (r) */
    Ifx_UReg_32Bit MOD_NUMBER:8;      /**< \brief [15:8] Module Number Value - MOD_NUMBER (r) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_SBCU_ID_Bits;

/** \brief Arbiter Priority Register High */
typedef struct _Ifx_SBCU_PRIOH_Bits
{
    Ifx_UReg_32Bit CPU2:4;            /**< \brief [3:0] CPU2 Priority - CPU2 (rw) */
    Ifx_UReg_32Bit CPU3:4;            /**< \brief [7:4] CPU3 Priority - CPU3 (rw) */
    Ifx_UReg_32Bit CPU4:4;            /**< \brief [11:8] CPU4 Priority - CPU4 (rw) */
    Ifx_UReg_32Bit CPU5:4;            /**< \brief [15:12] CPU5 Priority - CPU5 (rw) */
    Ifx_UReg_32Bit HSMRMI:4;          /**< \brief [19:16] HSMRMI Priority - HSMRMI (rw) */
    Ifx_UReg_32Bit HSMCMI:4;          /**< \brief [23:20] HSMCMI Priority - HSMCMI (rw) */
    Ifx_UReg_32Bit RESERVED14:4;      /**< \brief [27:24] \internal Reserved */
    Ifx_UReg_32Bit RESERVED15:4;      /**< \brief [31:28] \internal Reserved */
} Ifx_SBCU_PRIOH_Bits;

/** \brief Arbiter Priority Register Low */
typedef struct _Ifx_SBCU_PRIOL_Bits
{
    Ifx_UReg_32Bit SFI_S2F:4;         /**< \brief [3:0] SRI 2 FPI Bridge (SFI) Priority (DMA / Ceberus) - SFI_S2F (rw) */
    Ifx_UReg_32Bit RESERVED1:4;       /**< \brief [7:4] \internal Reserved */
    Ifx_UReg_32Bit SDMMC:4;           /**< \brief [11:8] SDMMC Priority - SDMMC (rw) */
    Ifx_UReg_32Bit HSSL0:4;           /**< \brief [15:12] HSSL0 Priority - HSSL0 (rw) */
    Ifx_UReg_32Bit HSSL1:4;           /**< \brief [19:16] HSSL1 Priority - HSSL1 (rw) */
    Ifx_UReg_32Bit RESERVED5:4;       /**< \brief [23:20] \internal Reserved */
    Ifx_UReg_32Bit CPU0:4;            /**< \brief [27:24] CPU0 Priority - CPU0 (rw) */
    Ifx_UReg_32Bit CPU1:4;            /**< \brief [31:28] CPU1 Priority - CPU1 (rw) */
} Ifx_SBCU_PRIOL_Bits;

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_sbcu_union
 * \{   */
/** \brief Access Enable Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_ACCEN0_Bits B;           /**< \brief Bitfield access */
} Ifx_SBCU_ACCEN0;

/** \brief Access Enable Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_ACCEN1_Bits B;           /**< \brief Bitfield access */
} Ifx_SBCU_ACCEN1;

/** \brief SBCU EDC Alarm Clear Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_ALCLR_Bits B;            /**< \brief Bitfield access */
} Ifx_SBCU_ALCLR;

/** \brief SBCU EDC Alarm Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_ALCTRL_Bits B;           /**< \brief Bitfield access */
} Ifx_SBCU_ALCTRL;

/** \brief SBCU EDC Alarm Status Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_ALSTAT0_Bits B;          /**< \brief Bitfield access */
} Ifx_SBCU_ALSTAT0;

/** \brief SBCU EDC Alarm Status Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_ALSTAT1_Bits B;          /**< \brief Bitfield access */
} Ifx_SBCU_ALSTAT1;

/** \brief SBCU EDC Alarm Status Register 2   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_ALSTAT2_Bits B;          /**< \brief Bitfield access */
} Ifx_SBCU_ALSTAT2;

/** \brief SBCU EDC Alarm Status Register 3   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_ALSTAT3_Bits B;          /**< \brief Bitfield access */
} Ifx_SBCU_ALSTAT3;

/** \brief SBCU Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_CON_Bits B;              /**< \brief Bitfield access */
} Ifx_SBCU_CON;

/** \brief SBCU Debug Address 1 Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_DBADR1_Bits B;           /**< \brief Bitfield access */
} Ifx_SBCU_DBADR1;

/** \brief SBCU Debug Address 2 Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_DBADR2_Bits B;           /**< \brief Bitfield access */
} Ifx_SBCU_DBADR2;

/** \brief SBCU Debug Trapped Address Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_DBADRT_Bits B;           /**< \brief Bitfield access */
} Ifx_SBCU_DBADRT;

/** \brief SBCU Debug Bus Operation Signals Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_DBBOS_Bits B;            /**< \brief Bitfield access */
} Ifx_SBCU_DBBOS;

/** \brief SBCU Debug Trapped Bus Operation Signals Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_DBBOST_Bits B;           /**< \brief Bitfield access */
} Ifx_SBCU_DBBOST;

/** \brief SBCU Debug Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_DBCNTL_Bits B;           /**< \brief Bitfield access */
} Ifx_SBCU_DBCNTL;

