Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSbcu_regdef.h
/** \brief SBCU Debug Data Status Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_DBDAT_Bits B;            /**< \brief Bitfield access */
} Ifx_SBCU_DBDAT;

/** \brief SBCU Debug Trapped Master Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_DBGNTT_Bits B;           /**< \brief Bitfield access */
} Ifx_SBCU_DBGNTT;

/** \brief SBCU Debug Grant Mask Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_DBGRNT_Bits B;           /**< \brief Bitfield access */
} Ifx_SBCU_DBGRNT;

/** \brief SBCU Error Address Capture Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_EADD_Bits B;             /**< \brief Bitfield access */
} Ifx_SBCU_EADD;

/** \brief SBCU Error Control Capture Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_ECON_Bits B;             /**< \brief Bitfield access */
} Ifx_SBCU_ECON;

/** \brief SBCU Error Data Capture Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_EDAT_Bits B;             /**< \brief Bitfield access */
} Ifx_SBCU_EDAT;

/** \brief FPI Error Generation Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_FEGEN_Bits B;            /**< \brief Bitfield access */
} Ifx_SBCU_FEGEN;

/** \brief Module Identification Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_ID_Bits B;               /**< \brief Bitfield access */
} Ifx_SBCU_ID;

/** \brief Arbiter Priority Register High   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_PRIOH_Bits B;            /**< \brief Bitfield access */
} Ifx_SBCU_PRIOH;

/** \brief Arbiter Priority Register Low   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SBCU_PRIOL_Bits B;            /**< \brief Bitfield access */
} Ifx_SBCU_PRIOL;

/** \}  */

/******************************************************************************/
/** \addtogroup IfxLld_Sbcu_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief SBCU object */
typedef volatile struct _Ifx_SBCU
{
       Ifx_UReg_8Bit                       reserved_0[8];          /**< \brief 0, \internal Reserved */
       Ifx_SBCU_ID                         ID;                     /**< \brief 8, Module Identification Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
       Ifx_SBCU_CON                        CON;                    /**< \brief 10, SBCU Control Register*/
       Ifx_SBCU_PRIOH                      PRIOH;                  /**< \brief 14, Arbiter Priority Register High*/
       Ifx_SBCU_PRIOL                      PRIOL;                  /**< \brief 18, Arbiter Priority Register Low*/
       Ifx_UReg_8Bit                       reserved_1C[4];         /**< \brief 1C, \internal Reserved */
       Ifx_SBCU_ECON                       ECON;                   /**< \brief 20, SBCU Error Control Capture Register*/
       Ifx_SBCU_EADD                       EADD;                   /**< \brief 24, SBCU Error Address Capture Register*/
       Ifx_SBCU_EDAT                       EDAT;                   /**< \brief 28, SBCU Error Data Capture Register*/
       Ifx_UReg_8Bit                       reserved_2C[4];         /**< \brief 2C, \internal Reserved */
       Ifx_SBCU_DBCNTL                     DBCNTL;                 /**< \brief 30, SBCU Debug Control Register*/
       Ifx_SBCU_DBGRNT                     DBGRNT;                 /**< \brief 34, SBCU Debug Grant Mask Register*/
       Ifx_SBCU_DBADR1                     DBADR1;                 /**< \brief 38, SBCU Debug Address 1 Register*/
       Ifx_SBCU_DBADR2                     DBADR2;                 /**< \brief 3C, SBCU Debug Address 2 Register*/
       Ifx_SBCU_DBBOS                      DBBOS;                  /**< \brief 40, SBCU Debug Bus Operation Signals Register*/
       Ifx_SBCU_DBGNTT                     DBGNTT;                 /**< \brief 44, SBCU Debug Trapped Master Register*/
       Ifx_SBCU_DBADRT                     DBADRT;                 /**< \brief 48, SBCU Debug Trapped Address Register*/
       Ifx_SBCU_DBBOST                     DBBOST;                 /**< \brief 4C, SBCU Debug Trapped Bus Operation Signals Register*/
       Ifx_SBCU_DBDAT                      DBDAT;                  /**< \brief 50, SBCU Debug Data Status Register*/
       Ifx_UReg_8Bit                       reserved_54[12];        /**< \brief 54, \internal Reserved */
       Ifx_SBCU_ALSTAT0                    ALSTAT0;                /**< \brief 60, SBCU EDC Alarm Status Register 0*/
       Ifx_SBCU_ALSTAT1                    ALSTAT1;                /**< \brief 64, SBCU EDC Alarm Status Register 1*/
       Ifx_SBCU_ALSTAT2                    ALSTAT2;                /**< \brief 68, SBCU EDC Alarm Status Register 2*/
       Ifx_SBCU_ALSTAT3                    ALSTAT3;                /**< \brief 6C, SBCU EDC Alarm Status Register 3*/
       Ifx_SBCU_ALCLR                      ALCLR[4];               /**< \brief 70, SBCU EDC Alarm Clear Register ${x}*/
       Ifx_SBCU_ALCTRL                     ALCTRL;                 /**< \brief 80, SBCU EDC Alarm Control Register*/
       Ifx_SBCU_FEGEN                      FEGEN;                  /**< \brief 84, FPI Error Generation Control Register*/
       Ifx_UReg_8Bit                       reserved_88[112];       /**< \brief 88, \internal Reserved */
       Ifx_SBCU_ACCEN1                     ACCEN1;                 /**< \brief F8, Access Enable Register 1*/
       Ifx_SBCU_ACCEN0                     ACCEN0;                 /**< \brief FC, Access Enable Register 0*/
} Ifx_SBCU;

/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSBCU_REGDEF_H */
